{
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "SimpleIntentClassifier",
      "layers": [
        {
          "name": "InputLayer",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 12],
            "dtype": "float32",
            "sparse": false,
            "name": "InputLayer"
          },
          "inbound_nodes": []
        },
        {
          "name": "EmbeddingsLayer",
          "class_name": "Embedding",
          "config": {
            "input_dim": 30,
            "output_dim": 50,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
            },
            "embeddings_regularizer": null,
            "activity_regularizer": null,
            "embeddings_constraint": null,
            "mask_zero": null,
            "input_length": 12,
            "name": "EmbeddingsLayer",
            "trainable": true,
            "batch_input_shape": [null, 12]
          },
          "inbound_nodes": [[["InputLayer", 0, 0, {}]]]
        },
        {
          "name": "LSTMLayer",
          "class_name": "LSTM",
          "config": {
            "name": "LSTMLayer",
            "trainable": true,
            "units": 128,
            "activation": "tanh",
            "recurrent_activation": "hard_sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": { "gain": 1, "seed": null }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "unit_forget_bias": null,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.30000001192092896,
            "recurrent_dropout": 0.30000001192092896,
            "implementation": null,
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false
          },
          "inbound_nodes": [[["EmbeddingsLayer", 0, 0, {}]]]
        },
        {
          "name": "DenseLayer",
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "DenseLayer",
            "trainable": true
          },
          "inbound_nodes": [[["LSTMLayer", 0, 0, {}]]]
        }
      ],
      "input_layers": [["InputLayer", 0, 0]],
      "output_layers": [["DenseLayer", 0, 0]]
    },
    "keras_version": "tfjs-layers 2.8.5",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "EmbeddingsLayer/embeddings",
          "shape": [30, 50],
          "dtype": "float32"
        },
        { "name": "LSTMLayer/kernel", "shape": [50, 512], "dtype": "float32" },
        {
          "name": "LSTMLayer/recurrent_kernel",
          "shape": [128, 512],
          "dtype": "float32"
        },
        { "name": "LSTMLayer/bias", "shape": [512], "dtype": "float32" },
        { "name": "DenseLayer/kernel", "shape": [128, 2], "dtype": "float32" },
        { "name": "DenseLayer/bias", "shape": [2], "dtype": "float32" }
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v2.8.5",
  "convertedBy": null
}
