{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Embedding",
          "config": {
            "input_dim": 5544,
            "output_dim": 300,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
            },
            "embeddings_regularizer": null,
            "activity_regularizer": null,
            "embeddings_constraint": null,
            "mask_zero": null,
            "input_length": 20,
            "name": "embedding_Embedding1",
            "trainable": false,
            "batch_input_shape": [null, 20]
          }
        },
        {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_LSTM1",
            "trainable": true,
            "units": 128,
            "activation": "tanh",
            "recurrent_activation": "hard_sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": { "gain": 1, "seed": null }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "unit_forget_bias": null,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.30000001192092896,
            "recurrent_dropout": 0.30000001192092896,
            "implementation": null,
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 4,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 2.5.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "lstm_LSTM1/kernel",
          "shape": [300, 512],
          "dtype": "float32"
        },
        {
          "name": "lstm_LSTM1/recurrent_kernel",
          "shape": [128, 512],
          "dtype": "float32"
        },
        { "name": "lstm_LSTM1/bias", "shape": [512], "dtype": "float32" },
        {
          "name": "dense_Dense1/kernel",
          "shape": [128, 4],
          "dtype": "float32"
        },
        { "name": "dense_Dense1/bias", "shape": [4], "dtype": "float32" },
        {
          "name": "embedding_Embedding1/embeddings",
          "shape": [5544, 300],
          "dtype": "float32"
        }
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v2.5.0",
  "convertedBy": null
}
